In [87]:
#Regular dictionary within dictionary
SpotCrudePrices_2013_Data={
    'U.K. Brent' : {'2013-Q1':112.9, '2013-Q2':103.0, '2013-Q3':110.1, '2013-Q4':109.4},
    'Dubai':{'2013-Q1':108.1, '2013-Q2':100.8, '2013-Q3':106.1,'2013-Q4':106.7},
    'West Texas Intermediate':{'2013-Q1':94.4, '2013-Q2':94.2, '2013-Q3':105.8,'2013-Q4':97.4}}

In [3]:
import pandas as pd

In [88]:
#Create dataframe from dict of dict
dubaiPrices = pd.DataFrame.from_dict(SpotCrudePrices_2013_Data)

In [5]:
pd.DataFrame(SpotCrudePrices_2013_Data)

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [6]:
SpotCrudePrices_2013_Data

{'Dubai': {'2013-Q1': 108.1,
  '2013-Q2': 100.8,
  '2013-Q3': 106.1,
  '2013-Q4': 106.7},
 'U.K. Brent': {'2013-Q1': 112.9,
  '2013-Q2': 103.0,
  '2013-Q3': 110.1,
  '2013-Q4': 109.4},
 'West Texas Intermediate': {'2013-Q1': 94.4,
  '2013-Q2': 94.2,
  '2013-Q3': 105.8,
  '2013-Q4': 97.4}}

In [10]:
dubaiPrices[['Dubai']]

         Dubai
2013-Q1  108.1
2013-Q2  100.8
2013-Q3  106.1
2013-Q4  106.7

In [11]:
dubaiPrices.Dubai

2013-Q1    108.1
2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: Dubai, dtype: float64

In [12]:
dubaiPrices.columns

Index(['Dubai', 'U.K. Brent', 'West Texas Intermediate'], dtype='object')

In [13]:
dubaiPrices.index

Index(['2013-Q1', '2013-Q2', '2013-Q3', '2013-Q4'], dtype='object')

In [16]:
#
dubaiPrices.describe()

            Dubai  U.K. Brent  West Texas Intermediate
count    4.000000    4.000000                 4.000000
mean   105.425000  108.850000                97.950000
std      3.195179    4.182902                 5.434151
min    100.800000  103.000000                94.200000
25%    104.775000  107.800000                94.350000
50%    106.400000  109.750000                95.900000
75%    107.050000  110.800000                99.500000
max    108.100000  112.900000               105.800000

In [17]:
dubaiPrices

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [18]:
#Changing col names
dubaiPrices.columns = ['Dubai','Brent','Texas']

In [19]:
dubaiPrices

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [28]:
#Get data by column index
dubaiPrices[[1,2]]

         Brent  Texas
2013-Q1  112.9   94.4
2013-Q2  103.0   94.2
2013-Q3  110.1  105.8
2013-Q4  109.4   97.4

In [32]:
import numpy as np
#Use arange to access elements
dubaiPrices[np.arange(1,3)]

         Brent  Texas
2013-Q1  112.9   94.4
2013-Q2  103.0   94.2
2013-Q3  110.1  105.8
2013-Q4  109.4   97.4

In [33]:
dubaiPrices[:2]

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2

In [35]:
dubaiPrices[2:]

         Dubai  Brent  Texas
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [36]:
dubaiPrices[::-1]

         Dubai  Brent  Texas
2013-Q4  106.7  109.4   97.4
2013-Q3  106.1  110.1  105.8
2013-Q2  100.8  103.0   94.2
2013-Q1  108.1  112.9   94.4

In [38]:
dubaiPrices[np.arange(2,3)]

         Texas
2013-Q1   94.4
2013-Q2   94.2
2013-Q3  105.8
2013-Q4   97.4

In [39]:
NYC_SnowAvgsData={'Months' :
['January','February','March', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [46]:
NYC_SnowAvgs_index=pd.DataFrame(NYC_SnowAvgsData,  
                          index= NYC_SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [47]:
NYC_SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [48]:
NYC_SnowAvgs=pd.DataFrame(NYC_SnowAvgsData,  
                         # index= NYC_SnowAvgsData['Months'], 
        columns = ['Months','Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [49]:
NYC_SnowAvgs

     Months  Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
0   January           4.0              17.8                 27
1  February           2.7              22.4                 29
2     March           1.7               9.1                 35
3     April           0.2               1.5                 45
4  November           0.2               0.8                 42
5  December           2.3              12.2                 32

In [50]:
NYC_SnowAvgs_index.loc['January']

Avg SnowDays          4.0
Avg Precip. (cm)     17.8
Avg Low Temp. (F)    27.0
Name: January, dtype: float64

In [51]:
NYC_SnowAvgs_index.loc[['January','April']]

         Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January           4.0              17.8                 27
April             0.2               1.5                 45

In [61]:
NYC_SnowAvgs_index.loc[:'April']

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [65]:
NYC_SnowAvgs_index.iloc[1:4]

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [71]:
#First element is row, next one is column
NYC_SnowAvgs_index.iloc[1:,:2]

          Avg SnowDays  Avg Precip. (cm)
February           2.7              22.4
March              1.7               9.1
April              0.2               1.5
November           0.2               0.8
December           2.3              12.2

In [68]:
NYC_SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [80]:
#Same index name being used
SnowAvgsData={'Months' :
['January','February','April', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [77]:
SnowAvgs_index=pd.DataFrame(SnowAvgsData,  
                          index= SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [78]:
SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
April              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [79]:
SnowAvgs_index.loc['April']

       Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
April           1.7               9.1                 35
April           0.2               1.5                 45

In [81]:
NYC_SnowAvgsData={'Months' :
['January','February','March', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [82]:
NYC_SnowAvgs=pd.DataFrame(NYC_SnowAvgsData,  
                         index= NYC_SnowAvgsData['Months'], 
        columns = ['Months','Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [86]:
#Selecting using boolean array
NYC_SnowAvgs.loc[NYC_SnowAvgs['Avg SnowDays']<1,:]

            Months  Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
April        April           0.2               1.5                 45
November  November           0.2               0.8                 42

In [85]:
#Returns boolean array
NYC_SnowAvgs['Avg SnowDays']<1

January     False
February    False
March       False
April        True
November     True
December    False
Name: Avg SnowDays, dtype: bool

In [97]:
dubaiPrices.loc[:,dubaiPrices.loc['2013-Q1']>110]

         U.K. Brent
2013-Q1       112.9
2013-Q2       103.0
2013-Q3       110.1
2013-Q4       109.4

In [91]:
dubaiPrices

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [96]:
dubaiPrices.loc['2013-Q1']>109

Dubai                      False
U.K. Brent                  True
West Texas Intermediate    False
Name: 2013-Q1, dtype: bool

### iloc - Integer Oriented Indexing

In [100]:
dubaiPrices.iloc[1:,2:]

         West Texas Intermediate
2013-Q2                     94.2
2013-Q3                    105.8
2013-Q4                     97.4

In [102]:
dubaiPrices.iat[3,0]

106.7

In [103]:
dubaiPrices.at['2013-Q4','Dubai']

106.7

In [104]:
import pandas as pd

In [107]:
stockDF = pd.read_csv(r'D:\data-science-ml-foundation-10\Stock.csv')

In [108]:
stockDF

  TradingDate   Nasdaq  S&P 500  Russell 2000
0  2014/01/30  4123.13  1794.19       1139.36
1  2014/01/31  4103.88  1782.59       1130.88
2  2014/02/03  3996.96  1741.89       1094.58
3  2014/02/04  4031.52  1755.20       1102.84
4  2014/02/05  4011.55  1751.64       1093.59
5  2014/02/06  4057.12  1773.43       1103.93

In [109]:
stockIndexDF = stockDF.set_index('TradingDate')

In [110]:
stockIndexDF

              Nasdaq  S&P 500  Russell 2000
TradingDate
2014/01/30   4123.13  1794.19       1139.36
2014/01/31   4103.88  1782.59       1130.88
2014/02/03   3996.96  1741.89       1094.58
2014/02/04   4031.52  1755.20       1102.84
2014/02/05   4011.55  1751.64       1093.59
2014/02/06   4057.12  1773.43       1103.93

In [111]:
stockIndexDF.ix['2014/02/03']

Nasdaq          3996.96
S&P 500         1741.89
Russell 2000    1094.58
Name: 2014/02/03, dtype: float64

In [112]:
stockIndexDF.ix[1]

Nasdaq          4103.88
S&P 500         1782.59
Russell 2000    1130.88
Name: 2014/01/31, dtype: float64

In [113]:
stockDF.ix[1]

TradingDate     2014/01/31
Nasdaq             4103.88
S&P 500            1782.59
Russell 2000       1130.88
Name: 1, dtype: object

### MultiIndexing

In [115]:
stock_data = pd.read_csv('MoreStock.csv')

In [116]:
stock_data

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [126]:
stock_Index_data = stock_data.set_index(['TradingDate','PriceType'])

In [129]:
stock_Index_data.head()

                        Nasdaq  S&P 500  Russell 2000
TradingDate PriceType
2014/02/21  open       4282.17  1841.07       1166.25
            close      4263.41  1836.25       1164.63
            high       4284.85  1846.13       1168.43
2014/02/24  open       4273.32  1836.78       1166.74
            close      4292.97  1847.61       1174.55

In [128]:
stock_Index_data.index

MultiIndex(levels=[['2014/02/21', '2014/02/24', '2014/02/25', '2014/02/26', '2014/02/27', '2014/02/28'], ['close', 'high', 'open']],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5], [2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1]],
           names=['TradingDate', 'PriceType'])

In [131]:
stock_Index_data.ix['2014/02/21','open']

Nasdaq          4282.17
S&P 500         1841.07
Russell 2000    1166.25
Name: (2014/02/21, open), dtype: float64

In [140]:
stock_Index_data.ix['2014/02/21':'2014/02/25']

                        Nasdaq  S&P 500  Russell 2000
TradingDate PriceType
2014/02/21  open       4282.17  1841.07       1166.25
            close      4263.41  1836.25       1164.63
            high       4284.85  1846.13       1168.43
2014/02/24  open       4273.32  1836.78       1166.74
            close      4292.97  1847.61       1174.55
            high       4311.13  1858.71       1180.29
2014/02/25  open       4298.48  1847.66       1176.00
            close      4287.59  1845.12       1173.95
            high       4307.51  1852.91       1179.43